In [1]:
import pandas as pd
df = pd.read_csv('2020-QS-World-University-Rankings.csv')
df.shape

(1025, 22)

## 1. All universities without NAN

In [48]:
df2 = df[['Rank in 2020', 'Institution Name', 'Country', 'Overall Score']]
df2 = df2.dropna()
df2

,Rank in 2020,Institution Name,Country,Overall Score
1,1,Massachusetts Institute of Technology (MIT),United States,100
2,2,Stanford University,United States,98.4
3,3,Harvard University,United States,97.4
4,4,University of Oxford,United Kingdom,97.2
5,5,California Institute of Technology (Caltech),United States,96.9
...,...,...,...,...
998,801-1000,Warsaw University of Life Sciences,Poland,9 - 14.1
999,801-1000,Wroc?aw University of Science and Technology,Poland,9 - 14.1
1000,801-1000,Wuhan University of Technology,China,9 - 14.1
1001,801-1000,Xi'an Jiaotong-Liverpool University,China,9 - 14.1
1002,801-1000,Yeungnam University,South Korea,9 - 14.1

### 1.1 Assign the average score  to the interval score values

In [49]:
import numpy as np

scores = np.zeros(df2.shape[0])
for i, score in enumerate(df2['Overall Score']):
    s = score.split(' - ')
    if len(s) == 1:
        scores[i] = float(s[0])
    else:
        scores[i] = (float(s[0]) + float(s[1])) / 2

df2['Ave_score'] = scores
df2

,Rank in 2020,Institution Name,Country,Overall Score,Ave_score
1,1,Massachusetts Institute of Technology (MIT),United States,100,100.00
2,2,Stanford University,United States,98.4,98.40
3,3,Harvard University,United States,97.4,97.40
4,4,University of Oxford,United Kingdom,97.2,97.20
5,5,California Institute of Technology (Caltech),United States,96.9,96.90
...,...,...,...,...,...
998,801-1000,Warsaw University of Life Sciences,Poland,9 - 14.1,11.55
999,801-1000,Wroc?aw University of Science and Technology,Poland,9 - 14.1,11.55
1000,801-1000,Wuhan University of Technology,China,9 - 14.1,11.55
1001,801-1000,Xi'an Jiaotong-Liverpool University,China,9 - 14.1,11.55
1002,801-1000,Yeungnam University,South Korea,9 - 14.1,11.55

In [41]:
df2[df2['Country']=='Australia']['Ave_score'].sum() / 35

1356.8

### 1.2 Group universities by Country

In [55]:
df_grouped = df2.groupby(by='Country').agg({'Ave_score': 'mean'})
df_count = df2.groupby(by='Country').count()

df_count_by_country = pd.DataFrame({'Country': df_grouped.index, 'Count': df_count['Institution Name'].values, 'Ave_score': df_grouped['Ave_score'].values})

df_count_by_country

           Country  Count  Ave_score
0        Argentina     13  23.511538
1        Australia     35  38.765714
2          Austria      8  30.943750
3       Azerbaijan      1  11.550000
4          Bahrain      1  11.550000
..             ...    ...        ...
77  United Kingdom     84  36.569643
78   United States    157  36.154459
79         Uruguay      2  17.925000
80       Venezuela      4  12.637500
81         Vietnam      2  13.725000

[82 rows x 3 columns]

### 1.3 Add hover text

In [67]:
df_count_by_country['Hover_text'] = [f'{country}<br><br>Universities: {count}<br>Average score: {score:.2f}' for country,count,score in df_count_by_country[['Country', 'Count', 'Ave_score']].values]

df_count_by_country

,Country,Count,Ave_score,Hover_text
0,Argentina,13,23.511538,Argentina<br><br>Universities: 13<br>Average s...
1,Australia,35,38.765714,Australia<br><br>Universities: 35<br>Average s...
2,Austria,8,30.943750,Austria<br><br>Universities: 8<br>Average scor...
3,Azerbaijan,1,11.550000,Azerbaijan<br><br>Universities: 1<br>Average s...
4,Bahrain,1,11.550000,Bahrain<br><br>Universities: 1<br>Average scor...
...,...,...,...,...
77,United Kingdom,84,36.569643,United Kingdom<br><br>Universities: 84<br>Aver...
78,United States,157,36.154459,United States<br><br>Universities: 157<br>Aver...
79,Uruguay,2,17.925000,Uruguay<br><br>Universities: 2<br>Average scor...
80,Venezuela,4,12.637500,Venezuela<br><br>Universities: 4<br>Average sc...
81,Vietnam,2,13.725000,Vietnam<br><br>Universities: 2<br>Average scor...

### 1.2 Write to CSV

In [68]:
df_count_by_country.to_csv(r'./count_by_country.csv', header=True, index=False)

## 2. Top 500 universities

In [3]:
df1 = df[['Rank in 2020', 'Institution Name', 'Country', 'Overall Score']]
df1 = df1.drop(index=0)
df1 = df1.iloc[range(500)]

df1['Rank in 2020'] = [int(x) if x.isnumeric() else int(x.strip()[:-1]) for x in df1['Rank in 2020']]

df1

,Rank in 2020,Institution Name,Country,Overall Score
1,1,Massachusetts Institute of Technology (MIT),United States,100
2,2,Stanford University,United States,98.4
3,3,Harvard University,United States,97.4
4,4,University of Oxford,United Kingdom,97.2
5,5,California Institute of Technology (Caltech),United States,96.9
...,...,...,...,...
496,491,University of Delaware,United States,24.3
497,491,V.N. Karazin Kharkiv National University,Ukraine,24.3
498,498,Czech Technical University In Prague,Czech Republic,24.2
499,498,Universit� de Montpellier,France,24.2
500,498,University of Eastern Finland,Finland,24.2

In [4]:
# Export modified df
df1.to_csv(r'./university_ranking_2021.csv', header=True, index=False)